_posts/management/2014-05-06-technical-manager.html
---
layout: post
title: How to Improve Technical Skill as a First Line Manager
categories: [management]
tags: [leadership]
---


<p>
As you know, a manager at line level is frequently involved in a lot
of meetings, such as line topic discussion meeting with other team
leaders, project management synchronization meeting, sprint planning
and sprint review meeting, interview talk with new candidates, etc. It
seems that my 8 hours are cut into pieces. I cannot find time longer
than 1 hour for code reading, or debugging. Here are some proposals on
how to better use my work time as a technical line manager.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Pair work with subordinates who comes across impediments.</h2>
<div class="outline-text-2" id="text-1">
<p>
We have daily standing meeting every morning. In the meeting, each
team member tell others what they have achieved last day, what they
plan to do in the following day and what impediment they
encountered. The last question is very important for me. I will listen
carefully and ask for the detail after the meeting.
</p>

<p>
Then I will follow the problem. If this problem blocks them again in
the coming day, I will try to find some time to pair work with this
team member. What I do is sitting together with him, and asking what
he have tried and what he plans to do. And then I analyze the problem
and the actions have done. It is quite often that at some degree there
is some systematically missing point. That usually is the key element
for solving the problem.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Review design and code</h2>
<div class="outline-text-2" id="text-2">
<p>
The programmers usually focuses on implementation while underestimate
the importance of design and documentation. I frequently inspect the
design description from the developers. It is important to find the
missing point from the design. Besides document review, code review is
also very good point for estimating the code quality and checking who
is implementing with good qualily sense. In the review record, you may
find some one treat other's code carefully and provide many
constructive comments. This is also good materials for yearly personal
performance appraisal.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Work for small tasks</h2>
<div class="outline-text-2" id="text-3">
<p>
As line manager's time is scattered over different kind of meetings
and discussions, it is hard to allocatge large time amount to focus on
difficult problems. So it is possible to claim some small tasks such
as investigation on new technology, developing small tool to improve
test and configuration management.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Read related books</h2>
<div class="outline-text-2" id="text-4">
<p>
In order to provide guidance to team member on design principle, it is
necessary that a line manager should continuously learn good design
patterns, code quality practice, domain knowleges. Therefore, it is
better to allocate time to read books.
</p>
</div>
</div>
